Repository: iworks/simple-consent-mode
Catalog: languages/simple-consent-mode-*.po
Languages: pl_pl

source: (always on)
pl_pl: (zawsze włączone)

source: Show Consents Configuration
pl_pl: Pokaż konfigurację zgód

source: Cookie Consent
pl_pl: Zgoda na pliki cookie

source: Main
pl_pl: Główne

source: Consent
pl_pl: Zgoda

source: Title
pl_pl: Tytuł

source: Description
pl_pl: Opis

source: We use cookies to personalize content and ads, to provide social media features and to analyze traffic to our site.
pl_pl: Wykorzystujemy ciasteczka do spersonalizowania treści i reklam, aby oferować funkcje społecznościowe i analizować ruch w naszej witrynie.

source: We share information about your use of our site with social media, advertising and analytics partners. These partners may combine this information with other data they have provided to you or obtained through your use of their services.
pl_pl: Informacje o tym, jak korzystasz z naszej witryny, udostępniamy partnerom społecznościowym, reklamowym i analitycznym. Partnerzy mogą połączyć te informacje z innymi danymi otrzymanymi od Ciebie lub uzyskanymi podczas korzystania z ich usług.

source: Information on how Google processes data can be found %s.
pl_pl: Informacja o tym, w jaki sposób Google przetwarza dane, znajdują się %s.

source: here
pl_pl: tutaj

source: You can use HTML tags in this field.
pl_pl: W tym polu możesz używać znaczników HTML.

source: Details
pl_pl: Szczegóły

source: About Cookies
pl_pl: O ciasteczkach

source: Show Tab
pl_pl: Pokaż zakładkę

source: Cookies are small data files stored on your device by websites to remember your preferences, login details, or actions. There are different types, including session cookies (temporary) and persistent cookies (long-term). They help personalize your browsing experience but can also track your online behavior.
pl_pl: Ciasteczka to małe pliki danych przechowywane na urządzeniu przez witryny internetowe w celu zapamiętania preferencji, danych logowania lub działań. Istnieją różne typy, w tym ciasteczka sesyjne (tymczasowe) i trwałe (długoterminowe). Pomagają one spersonalizować wrażenia z przeglądania, ale mogą również śledzić zachowanie online.

source: Consent refers to the permission websites must obtain from users before using cookies that collect personal data. Laws like the GDPR require websites to ask for explicit consent through cookie banners, allowing users to accept or reject cookies and control their privacy. You can also withdraw consent at any time, typically through the website’s privacy settings, which lets you manage or delete stored cookies whenever you choose.
pl_pl: Zgoda odnosi się do zgody, którą witryny muszą uzyskać od użytkowników przed użyciem ciasteczek gromadzących dane osobowe. Przepisy takie jak GDPR wymagają, aby witryny prosiły o wyraźną zgodę, umożliwiając użytkownikom akceptowanie lub odrzucanie ciasteczek i kontrolowanie swojej prywatności. Możesz również wycofać zgodę w dowolnym momencie, zazwyczaj za pośrednictwem ustawień prywatności witryny, które umożliwiają zarządzanie lub usuwanie przechowywanych ciasteczek w dowolnym momencie.

source: For more details on how a website uses cookies and collects data, you can refer to the website’s privacy policy. This document outlines the types of cookies used, data collected, and how your information is stored or shared. It also explains how you can manage your preferences.
pl_pl: Aby uzyskać więcej szczegółów na temat tego, jak witryna internetowa używa ciasteczek i jak zbiera dane, zapoznaj się z polityką prywatności witryny. Ten dokument opisuje rodzaje używanych plików cookie, zbierane dane oraz sposób przechowywania lub udostępniania Twoich informacji. Wyjaśnia również, jak możesz zarządzać swoimi preferencjami.

source: Buttons
pl_pl: Przyciski

source: Allow All
pl_pl: Zezwól na wszystko

source: On the first tab
pl_pl: Na każdej następnej

source: Not on the first tab
pl_pl: W pierwszej zakładce

source: Allow Selection
pl_pl: Zezwól na wybór

source: Choose Consents
pl_pl: Wybierz zgody

source: Personalize
pl_pl: Personalizuj

source: Deny All Consents
pl_pl: Odrzuć wszystkie zgody

source: Deny
pl_pl: Odmów

source: Design
pl_pl: Wygląd

source: Dialog
pl_pl: Okno modalne

source: Width
pl_pl: Długość

source: Radius
pl_pl: Zaokrąglenie

source: Background
pl_pl: Tło

source: Backdrop
pl_pl: Tło okna modalnego

source: Primary
pl_pl: Główny

source: Show
pl_pl: Pokaż

source: Image
pl_pl: Obrazek

source: Max Height
pl_pl: Maksymalna wysokość

source: Button Primary
pl_pl: Podstawowy przycisk

source: Text
pl_pl: Tekst

source: Button
pl_pl: Przycisk

source: Checkbox
pl_pl: Pole zaznaczenia

source: Icon
pl_pl: Ikonka

source: Icon Primary
pl_pl: Kolor podstawowy ikonki

source: Icon Accent
pl_pl: Akcent kolorystyczny ikonki

source: Consents
pl_pl: Zgody

source: Functional
pl_pl: Funkcjonalne

source: Manages the storage of cookies for essential functions like login.
pl_pl: Zarządza przechowywaniem ciasteczek dla podstawowych funkcji, takich jak logowanie.

source: Always on
pl_pl: Zawsze włączone

source: Functionality
pl_pl: Funkcjonalność

source: Necessary cookies help make a website usable by enabling basic functions such as page navigation and access to secure areas of the website. The website cannot function properly without these cookies.
pl_pl: Ciasteczka niezbędne do funkcjonowania witryny internetowej, umożliwiając podstawowe funkcje, takie jak nawigacja po stronach i dostęp do bezpiecznych obszarów witryny. Witryna internetowa nie może działać prawidłowo bez tych ciasteczek.

source: Analytics Storage
pl_pl: Przechowywanie statystyk

source: Enables storage (such as cookies) related to analytics e.g. visit duration.
pl_pl: Umożliwia przechowywanie danych (np. ciasteczek) dotyczących statystyk, np. czasu trwania wizyty.

source: Analytic Storage
pl_pl: Przechowywanie statystyk

source: Controls whether data related to website usage and user behavior can be stored for analytics purposes (e.g., Google Analytics).
pl_pl: Kontroluje, czy dane dotyczące korzystania z witryny internetowej i zachowań użytkowników mogą być przechowywane w celach analitycznych (np. Google Analytics).

source: Ad Storage
pl_pl: Przechowywanie reklam

source: Enables storage (such as cookies) related to advertising.
pl_pl: Umożliwia przechowywanie danych (np. ciasteczek) związanych z reklamami.

source: Manages whether advertising-related data (like targeting and tracking cookies) can be stored and processed for ad services.
pl_pl: Zarządza tym, czy dane związane z reklamami (np. ciasteczka do targetowania i śledzenia) mogą być przechowywane i przetwarzane na potrzeby usług reklamowych.

source: Ad Personalization
pl_pl: Personalizacja reklam

source: Sets consent for personalized advertising.
pl_pl: Określa stan zgody na reklamy spersonalizowane.

source: Determines if personalized ads can be shown based on user behavior and preferences, using stored data for targeting.
pl_pl: Określa, czy można wyświetlać spersonalizowane reklamy na podstawie zachowań i preferencji użytkownika, wykorzystując w tym celu zapisane dane.

source: Ad User Data
pl_pl: Przechowywanie danych użytkownika

source: Sets consent for sending user data related to advertising to Google. The ad_user_data consent type is required for measurement use cases, such as enhanced conversions and tag-based conversion tracking.
pl_pl: Określa stan zgody na wysyłanie do Google danych użytkownika związanych z reklamami. Typ zgody ad_user_data jest wymagany w przypadkach użycia związanych z pomiarem, np. na potrzeby konwersji rozszerzonych i śledzenia konwersji na podstawie tagu.

source: Controls the storage of user-specific data for ad tracking, profiling, and measuring ad effectiveness.
pl_pl: Kontroluje przechowywanie danych specyficznych dla użytkownika, służących do śledzenia reklam, profilowania i pomiaru skuteczności reklam.

source: Personalization Storage
pl_pl: Przechowywanie

source: Enables storage related to personalization e.g. video recommendations
pl_pl: Umożliwia przechowywanie danych dotyczących personalizacji, np. rekomendacji filmów

source: Personalizations
pl_pl: Personalizacja

source: Regulates whether data used to provide personalized user experiences (like content recommendations) can be stored.
pl_pl: Reguluje, czy dane służące do zapewniania użytkownikom spersonalizowanych doświadczeń (np. rekomendacji treści) mogą być przechowywane.

source: Security Storage
pl_pl: Bezpieczeństwo

source: Enables storage related to security such as authentication functionality, fraud prevention, and other user protection.
pl_pl: Umożliwia przechowywanie danych związanych z zabezpieczeniami, takimi jak funkcja uwierzytelniania, zapobieganie oszustwom i inne mechanizmy ochrony użytkowników.

source: Security
pl_pl: Bezpieczeństwo

source: Security storage is the practice of safely storing sensitive data using encryption or secure methods to prevent unauthorized access or theft.
pl_pl: Przechowywanie danych w bezpiecznym miejscu polega na stosowaniu szyfrowania i innych bezpiecznych metod, aby uniemożliwić nieautoryzowany dostęp lub kradzież.

source: Cookie
pl_pl: Ciasteczko

source: Version
pl_pl: Wersja

source: Changing the cookie version requires you to obtain new consent. This should be done in the event of changes to the scope of required consents.
pl_pl: Zmiana wersji pliku cookie wymaga uzyskania nowej zgody. Należy to zrobić w przypadku zmian w zakresie wymaganych zgód.

source: Log
pl_pl: Dziennik

source: Enable
pl_pl: Włącz

source: Enable or disable consent logging as needed.
pl_pl: W razie potrzeby włącz lub wyłącz rejestrowanie zgody.

source: Duration
pl_pl: Czas trwania

source: Months
pl_pl: Miesięcy

source: The "Log Duration" setting specifies the length of time, in months, that log entries will be retained. Once the selected duration has passed, the system will automatically delete any log entries older than the chosen period. This helps manage storage and ensures logs are only kept for a predefined, manageable timeframe.
pl_pl: Ustawienie "Czas trwania dziennika" określa czas (w miesiącach), przez jaki wpisy dziennika będą przechowywane. Po upływie wybranego czasu system automatycznie usunie wszystkie wpisy dziennika starsze niż wybrany okres. Pomaga to w zarządzaniu pamięcią masową i zapewnia, że dzienniki są przechowywane tylko przez wstępnie zdefiniowany, możliwy do zarządzania okres.

source: Export
pl_pl: Eksport

source: Export CSV File
pl_pl: Eksportuj plik CSV

source: The "Export CSV File" feature allows you to download the consents log in a CSV format. This provides an easy way to view, analyze, and share consent data in a structured, spreadsheet-compatible file.
pl_pl: Funkcja "Eksportuj plik CSV" umożliwia pobranie rejestru zgód w formacie CSV. Zapewnia to łatwy sposób przeglądania, analizowania i udostępniania danych zgody w ustrukturyzowanym pliku zgodnym z arkuszem kalkulacyjnym.

source: About Consent Mode
pl_pl: O zgodach

source: Consent Mode is a tool provided by Google that allows websites to adjust the behavior of Google tags (such as Google Analytics, Google Ads, and others) depending on the user's consent for data processing. It enables more compliant data collection while respecting user privacy preferences.
pl_pl: Consent Mode to narzędzie udostępniane przez Google, które pozwala witrynom internetowym dostosowywać zachowanie tagów Google (takich jak Google Analytics, Google Ads i inne) w zależności od zgody użytkownika na przetwarzanie danych. Umożliwia bardziej zgodne gromadzenie danych przy jednoczesnym poszanowaniu preferencji prywatności użytkownika.

source: Consent Type
pl_pl: Typ zgody

source: This option defines the type of consent requested from users, determining whether they consent to cookies for specific purposes (e.g., analytics, marketing, etc.). Typically, the options include:
pl_pl: Opcja definiuje rodzaj zgody żądanej od użytkowników, określając, czy wyrażają oni zgodę na pliki cookie w określonych celach (np. analityka, marketing itp.). Zazwyczaj opcje obejmują:

source: Default Consent Behavior
pl_pl: Domyślne zachowanie zgody

source: If the user has not yet provided consent or declined, you can define the default behavior. By default, Google tags will work in a limited mode (for example, without tracking conversions or storing data for ad targeting).
pl_pl: Jeśli użytkownik nie wyraził jeszcze zgody lub odmówił, możesz zdefiniować domyślne zachowanie. Domyślnie tagi Google będą działać w trybie ograniczonym (na przykład bez śledzenia konwersji lub przechowywania danych do kierowania reklam).

source: Consent Update Mechanism
pl_pl: Mechanizm aktualizacji zgody

source: This feature allows websites to update the user's consent status if they change their preferences after the initial consent. It ensures that Google services (such as Analytics and Ads) react accordingly and adjust their behavior based on the new consent status.
pl_pl: Funkcja umożliwia witrynom aktualizowanie statusu zgody użytkownika, jeśli zmienią swoje preferencje po wyrażeniu początkowej zgody. Zapewnia, że ​​usługi Google (takie jak Analytics i Ads) zareagują odpowiednio i dostosują swoje zachowanie na podstawie nowego statusu zgody.

source: Consent Mode Events
pl_pl: Wydarzenia Consent Mode

source: Consent Mode events provide a way to trigger certain actions when consent preferences are updated. For instance, if a user consents to analytics storage, the website can trigger a specific event to begin tracking user interactions.
pl_pl: Wydarzenia Consent Mode zapewniają sposób na wyzwolenie pewnych działań, gdy preferencje zgody są aktualizowane. Na przykład, jeśli użytkownik wyrazi zgodę na przechowywanie analiz, witryna może wyzwolić określone zdarzenie, aby rozpocząć śledzenie interakcji użytkownika.

source: Data Retention Options
pl_pl: Opcje przechowywania danych

source: With Consent Mode, you can set up specific data retention policies to define how long user data should be stored based on their consent. For example, if users withdraw consent, the data collected can be deleted or anonymized.
pl_pl: W trybie zgody możesz skonfigurować określone zasady przechowywania danych, aby określić, jak długo dane użytkownika powinny być przechowywane na podstawie jego zgody. Na przykład, jeśli użytkownicy wycofają zgodę, zebrane dane mogą zostać usunięte lub zanonimizowane.

source: Tracking Blocking (No Consent)
pl_pl: Blokowanie śledzenia (brak zgody)

source: In cases where the user has not given consent for cookies or data tracking, this option ensures that all data collection and tracking mechanisms are blocked, fully respecting the user's privacy preferences.
pl_pl: W przypadku, gdy użytkownik nie wyraził zgody na stosowanie plików cookie lub śledzenie danych, opcja ta zapewnia, że ​​wszelkie mechanizmy gromadzenia i śledzenia danych zostaną zablokowane, w pełni respektując preferencje użytkownika dotyczące prywatności.

source: We are waiting for your message
pl_pl: Czekamy na twoją wiadomość

source: I love what I do!
pl_pl: Kocham to, co robię!

source: Below are some links to help spread this plugin to other users
pl_pl: Poniżej znajdują się odnośniki, które pomogą w rozpowszechnianiu wtyczki wśród innych użytkowników

source: Give it a five stars on WordPress.org
pl_pl: Daj pięć gwiazdek na WordPress.org

source: Link to it so others can easily find it
pl_pl: Odnośnik, aby inni mogli łatwo znaleźć

source: WordPress Help Forum
pl_pl: Forum pomocy WordPressa

source: Google codename
pl_pl: Kod Google

source: Missing template file: %1$s/%2$s/%3$s.
pl_pl: Brak pliku szablonu: %1$s/%2$s/%3$s.

source: Simple Consent Mode
pl_pl: Proste zgody

source: Show Consents
pl_pl: Pokaż zgody

source: Open dialog to view and manage consents.
pl_pl: Otwórz okno dialogowe, aby wyświetlić zgody i zarządzać nimi.

source: An error occurred while getting the configuration.
pl_pl: Wystąpił błąd w czasie pobierania konfiguracji.

source: Select Image
pl_pl: Wybierz obrazek

source: Delete image
pl_pl: Usuń obrazek

source: Save Changes
pl_pl: Zapisz zmiany

source: Country
pl_pl: Kraj

source: City
pl_pl: Miasto

source: Street
pl_pl: Ulica

source: ZIP code
pl_pl: Kod pocztowy

source: OFF
pl_pl: Wyłącz

source: ON
pl_pl: Włącz

source: Failed Security Check
pl_pl: Nieudana kontrola bezpieczeństwa

source: Settings
pl_pl: Ustawienia

source: Provide us a coffee
pl_pl: Postaw nam kawę

source: There is no plugin with id: %s.
pl_pl: Brak wtyczki o identyfikatorze %s.

source: OG — Better Share on Social Media
pl_pl: OG — Lepsze udostępnianie w mediach społecznościowych

source: https://wordpress.org/plugins/og/
pl_pl: https://pl.wordpress.org/plugins/og/

source: Would you like to boost your website sharing abilities?
pl_pl: Czy chcesz zwiększyć możliwości dzielenia się witryną?

source: Don't wait, install plugin %s!
pl_pl: Nie czekaj, zainstaluj wtyczkę %s!

source: Install
pl_pl: Zainstaluj

source: Thank you for using our plugin %s!
pl_pl: Dziękujemy za używanie naszej wtyczki %s!

source: Please let us know what you think about our plugin. It is important that we can develop this tool. Thank you for all the ratings, reviews and donates. If you have a technical problem, please before you add a review %1$scheck our FAQ%2$s or contact us if you did not find help there. We will try to help you!
pl_pl: Powiedz nam co myślisz o naszej wtyczce. To jest bardzo ważne dla nas i pozwoli nam ją rozwijać. Dziękujemy serdecznie za wszystkie oceny, recenzje i dodatkowe wsparcie. Jeżeli masz problem techniczny, prosimy zanim dodasz recenzję %1$ssprawdź nasze FAQ%2$s lub skontaktuj się z nami, jeżeli nie znajdziesz tam pomocy. Postaramy się tobie pomóc!

source: Get help
pl_pl: Skorzystaj z pomocy

source: Add review
pl_pl: Dodaj recenzję

source: I added review, do not show again
pl_pl: Recenzja została dodana, nie pokazuj ponownie

source: However, working on plugins and technical support requires many hours of work. If you want to appreciate it, you can provide me a coffee.
pl_pl: Praca nad wtyczkami oraz świadczenie pomocy technicznej wymaga ode mnie wielu godzin ciężkiej pracy. Jeżeli chcesz to docenić, możesz postawić mi kawę.

source: If every plugin user did it, I could devote myself fully to working on this plugin. Thanks everyone!
pl_pl: Gdyby każdy użytkownik wtyczki to zrobił, to mógłbym poświęcić cały swój czas pracy nad wtyczką. Dziękuję każdemu!

source: Provide me a coffee
pl_pl: Postaw mi kawę

source: Do you have a technical problem? Please contact us. We will be happy to help you. Or maybe you have an idea for a new feature? Please let us know about it by filling the support form. We will try to add it!
pl_pl: Masz problem techniczny? Prosimy o kontakt z nami. Z przyjemnością tobie pomożemy. A może masz pomysł na nową funkcjonalność? Poinformuj nas o tym, dodając wątek na forum technicznym. Weźmiemy to pod uwagę!

source: Please %1$scheck our FAQ%2$s before adding a thread with technical problem. If you do not find help there, %3$scheck support forum%4$s for similar problems.
pl_pl: Zobacz %1$snasze FAQ%2$s zanim dodasz wątek w dziale pomocy technicznej. Jeżeli nie znajdziesz tam pomocy, sprawdź również %3$sforum techniczne%4$s pod kątem podobnych problemów.

source: Do you like our plugin? Could you rate him? Please let us know what you think about our plugin. It is important that we can develop this tool. Thank you for all the ratings, reviews and donates.
pl_pl: Jak podoba się nasza wtyczka? Masz możliwość ją ocenić? Daj nam znać, co o niej myślisz. To dla nas bardzo ważne, aby móc ją rozwijać. Dziękujemy za wszystkie oceny, recenzje oraz dodatkowe wsparcie.

source: Donate
pl_pl: Przekaż datek

# plugin home page on WordPress.org
source: https://wordpress.org/plugins/simple-consent-mode/
pl_pl: https://pl.wordpress.org/plugins/simple-consent-mode/

# link to support forum on WordPress.org
source: https://wordpress.org/support/plugin/simple-consent-mode/
pl_pl: https://pl.wordpress.org/support/plugin/simple-consent-mode/

# plugins home
source: https://wordpress.org/plugins/%s
pl_pl: https://pl.wordpress.org/plugins/%s
